# parameters
nc: 10  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
# COCO
#  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

# BDD100k Gaussian YOLOv3 https://arxiv.org/pdf/1904.04620.pdf
  - [ 7,10, 14,24, 27,43 ]  # P3/8
  - [ 32,97, 57,64, 92,109 ]  # P4/16
  - [ 73,175, 141,178, 144,291 ]  # P5/32


# CSPDarknet-53 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, BottleneckCSP, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 2, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 8, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 8, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]], # 9-P5/32
   [-1, 4, BottleneckCSP, [1024]],  # 10
  ]

# YOLOv4 SPP PANet modified from yolov4.cfg
head:
  [[-1, 1, Bottleneck, [1024, False]],  # 11
   [-1, 1, SPP, [512, [5, 9, 13]]],  # conv1x1+SPP+conv1x1
   [-1, 1, Conv, [1024, 3, 1]],
   [-1, 1, Conv, [512, 1, 1]],  # 14
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, "nearest"]],
   [8, 1, Conv, [256, 1, 1]],  # backbone P4 dim-reduction 512->256
   [[-2, -1], 1, Concat, [1]],  # concat backbone P4

   [-1, 2, Bottleneck, [512, False]],
   [-1, 1, Conv, [256, 1, 1]],  # 20
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, "nearest"]],
   [6, 1, Conv, [128, 1, 1]],  # backbone P3 dim-reduction 256->128
   [[-2, -1], 1, Concat, [1]],  # concat backbone P3

   [-1, 2, Bottleneck, [256, False]],
   [-1, 1, Conv, [128, 1, 1]],  # 26
   [-1, 1, Conv, [256, 3, 1]], # 27 (P3/8-small)

   [26, 1, Conv, [256, 3, 2]], # down sample
   [[-1, 20], 1, Concat, [1]],  # concat 20
   [-1, 2, Bottleneck, [512, False]],
   [-1, 1, Conv, [256, 1, 1]],  # 31
   [-1, 1, Conv, [512, 3, 1]],  # 32 (P4/16-medium)

   [31, 1, Conv, [512, 3, 2]], # down sample
   [[-1, 14], 1, Concat, [1]],  # concat 14
   [-1, 3, Bottleneck, [1024, False]], # 35 (P5/32-large)

   [[27, 32, 35], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]