# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  # COCO
  #  - [10,13, 16,30, 33,23]  # P3/8
  #  - [30,61, 62,45, 59,119]  # P4/16
  #  - [116,90, 156,198, 373,326]  # P5/32

  # BDD100k Gaussian YOLOv3 https://arxiv.org/pdf/1904.04620.pdf
#  - [ 7,10, 14,24, 27,43 ]  # P3/8
#  - [ 32,97, 57,64, 92,109 ]  # P4/16
#  - [ 73,175, 141,178, 144,291 ]  # P5/32

  # BDD100k-tiny Auto anchor 512x512
  #  - [ 4,5,  8,6,  7,12 ]  # P3/8
  #  - [ 13,11,  11,22,  25,18 ]  # P4/16
  #  - [ 40,33,  80,53,  159,123 ]  # P5/32

# Auto Anchor kitti_cls3 512x512
  - [ 13,10,  8,23,  20,15 ]  # P3/8
  - [ 35,18,  19,43,  52,27 ]  # P4/16
  - [ 35,74,  84,47,  127,71 ]  # P5/32


# CSPDarknet-53 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Bottleneck, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 2, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 8, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 8, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]], # 9-P5/32
   [-1, 4, C3, [1024]],  # 10
  ]

# YOLOv4 SPPCSP PACSP+CA
head:
  [[-1, 1, SPPCSP2, [512, [5, 9, 13]]],  # 11 -->
   [-1, 1, nn.Upsample, [None, 2, "nearest"]],
   [[-1, 8], 1, Concat, [1]],  # concat backbone P4  1024
   [-1, 3, C3_CA, [512, False]],  # 14

   [-1, 1, Conv, [256, 1, 1]],  # 15 -->
   [-1, 1, nn.Upsample, [None, 2, "nearest"]],
   [[-1, 6], 1, Concat, [1]],  # concat backbone P3  512
   [-1, 3, C3_CA, [256, False]], # 18 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]], # down sample
   [[-1, 15], 1, Concat, [1]],  # concat 15  512
   [-1, 3, C3_CA, [512, False]],  # 21 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]], # down sample
   [[-1, 11], 1, Concat, [1]],  # concat 11  1024
   [-1, 3, C3_CA, [1024, False]], # 24 (P5/32-large)

   [[18, 21, 24], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]