# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 0.75  # channel base=6 while yolo-v3 base=8

# anchors
anchors: 3

# poly-yolo backbone 1,2,8,8,8
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Bottleneck, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 2, Bottleneck, [128]],  #        tiny 4
   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 8, Bottleneck, [256]],  #        small 6
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 8, Bottleneck, [512]],  #        medium 8
   [-1, 1, Conv, [1024, 3, 2]],  # 9-P5/32
   [-1, 8, Bottleneck, [1024]],  #       large 10
  ]

# poly-yolo head
head:
  [[-1, 1, Conv, [128, [1, 1]]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [8, 1, Conv, [128, [1, 1]]],
   add,
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [128, [1, 1]]],
   add,
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [4, 1, Conv, [128, [1, 1]]],
   add,
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1], 1, Detect, [nc, anchors]],   # Detect
  ]
